benchmark/leveldb/results/large-ratio/mris_ratio_ssd.64.1.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:35:29 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1567.640 micros/op;    6.1 MB/s small: 10000/0; big: 157/0
Microseconds per op:
Count: 10157  Average: 1567.6578  StdDev: 10480.79
Min: 0.0000  Median: 721.5909  Max: 373488.0000
------------------------------------------------------
[       0,       1 )      21   0.207%   0.207% 
[       1,       2 )      62   0.610%   0.817% 
[       2,       3 )      59   0.581%   1.398% 
[       3,       4 )      14   0.138%   1.536% 
[      18,      20 )       1   0.010%   1.546% 
[      20,      25 )      29   0.286%   1.831% 
[      25,      30 )      92   0.906%   2.737% 
[      30,      35 )     253   2.491%   5.228% 
[      35,      40 )    1114  10.968%  16.196% ##
[      40,      45 )     484   4.765%  20.961% #
[      45,      50 )      20   0.197%  21.158% 
[      50,      60 )      53   0.522%  21.680% 
[      60,      70 )       3   0.030%  21.709% 
[      70,      80 )       1   0.010%  21.719% 
[      80,      90 )     541   5.326%  27.045% #
[      90,     100 )     775   7.630%  34.676% ##
[     100,     120 )     673   6.626%  41.302% #
[     120,     140 )     395   3.889%  45.191% #
[     140,     160 )     228   2.245%  47.435% 
[     160,     180 )      81   0.797%  48.233% 
[     180,     200 )      59   0.581%  48.814% 
[     200,     250 )      44   0.433%  49.247% 
[     250,     300 )       6   0.059%  49.306% 
[     300,     350 )       3   0.030%  49.335% 
[     350,     400 )       3   0.030%  49.365% 
[     400,     450 )      13   0.128%  49.493% 
[     450,     500 )      13   0.128%  49.621% 
[     500,     600 )      21   0.207%  49.828% 
[     600,     700 )       8   0.079%  49.906% 
[     700,     800 )      44   0.433%  50.340% 
[     800,     900 )      92   0.906%  51.245% 
[     900,    1000 )     190   1.871%  53.116% 
[    1000,    1200 )     591   5.819%  58.935% #
[    1200,    1400 )     374   3.682%  62.617% #
[    1400,    1600 )    1144  11.263%  73.880% ##
[    1600,    1800 )     159   1.565%  75.446% 
[    1800,    2000 )      22   0.217%  75.662% 
[    2000,    2500 )      54   0.532%  76.194% 
[    2500,    3000 )    1820  17.919%  94.112% ####
[    3000,    3500 )     369   3.633%  97.745% #
[    3500,    4000 )      42   0.414%  98.159% 
[    4000,    4500 )      56   0.551%  98.710% 
[    4500,    5000 )      14   0.138%  98.848% 
[    5000,    6000 )      42   0.414%  99.262% 
[    6000,    7000 )      18   0.177%  99.439% 
[    7000,    8000 )      27   0.266%  99.705% 
[    8000,    9000 )       1   0.010%  99.714% 
[   10000,   12000 )       1   0.010%  99.724% 
[   12000,   14000 )       1   0.010%  99.734% 
[   18000,   20000 )       1   0.010%  99.744% 
[   20000,   25000 )       1   0.010%  99.754% 
[   30000,   35000 )       1   0.010%  99.764% 
[   40000,   45000 )       1   0.010%  99.774% 
[   50000,   60000 )       1   0.010%  99.783% 
[   90000,  100000 )       3   0.030%  99.813% 
[  100000,  120000 )       3   0.030%  99.842% 
[  120000,  140000 )       3   0.030%  99.872% 
[  140000,  160000 )       3   0.030%  99.902% 
[  160000,  180000 )       1   0.010%  99.911% 
[  200000,  250000 )       2   0.020%  99.931% 
[  250000,  300000 )       1   0.010%  99.941% 
[  300000,  350000 )       2   0.020%  99.961% 
[  350000,  400000 )       4   0.039% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	157
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0