benchmark/leveldb/results/large-ratio/mris_ratio_ssd.64.2.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:35:54 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1564.301 micros/op;    6.2 MB/s small: 10000/0; big: 157/0
Microseconds per op:
Count: 10157  Average: 1564.3206  StdDev: 11661.18
Min: 0.0000  Median: 712.2222  Max: 707028.0000
------------------------------------------------------
[       0,       1 )      19   0.187%   0.187% 
[       1,       2 )      64   0.630%   0.817% 
[       2,       3 )      60   0.591%   1.408% 
[       3,       4 )      13   0.128%   1.536% 
[      18,      20 )       1   0.010%   1.546% 
[      20,      25 )      30   0.295%   1.841% 
[      25,      30 )      92   0.906%   2.747% 
[      30,      35 )     263   2.589%   5.336% #
[      35,      40 )    1112  10.948%  16.284% ##
[      40,      45 )     478   4.706%  20.990% #
[      45,      50 )      17   0.167%  21.158% 
[      50,      60 )      56   0.551%  21.709% 
[      60,      70 )       3   0.030%  21.739% 
[      70,      80 )       1   0.010%  21.749% 
[      80,      90 )     539   5.307%  27.055% #
[      90,     100 )     783   7.709%  34.764% ##
[     100,     120 )     667   6.567%  41.331% #
[     120,     140 )     402   3.958%  45.289% #
[     140,     160 )     218   2.146%  47.435% 
[     160,     180 )      90   0.886%  48.321% 
[     180,     200 )      55   0.541%  48.863% 
[     200,     250 )      43   0.423%  49.286% 
[     250,     300 )       8   0.079%  49.365% 
[     300,     350 )       3   0.030%  49.395% 
[     400,     450 )      13   0.128%  49.522% 
[     450,     500 )      13   0.128%  49.650% 
[     500,     600 )      22   0.217%  49.867% 
[     600,     700 )       8   0.079%  49.946% 
[     700,     800 )      45   0.443%  50.389% 
[     800,     900 )      92   0.906%  51.295% 
[     900,    1000 )     186   1.831%  53.126% 
[    1000,    1200 )     597   5.878%  59.004% #
[    1200,    1400 )     373   3.672%  62.676% #
[    1400,    1600 )    1149  11.312%  73.988% ##
[    1600,    1800 )     153   1.506%  75.495% 
[    1800,    2000 )      21   0.207%  75.701% 
[    2000,    2500 )      55   0.541%  76.243% 
[    2500,    3000 )    1817  17.889%  94.132% ####
[    3000,    3500 )     371   3.653%  97.785% #
[    3500,    4000 )      37   0.364%  98.149% 
[    4000,    4500 )      58   0.571%  98.720% 
[    4500,    5000 )      15   0.148%  98.868% 
[    5000,    6000 )      38   0.374%  99.242% 
[    6000,    7000 )      21   0.207%  99.449% 
[    7000,    8000 )      26   0.256%  99.705% 
[   10000,   12000 )       2   0.020%  99.724% 
[   14000,   16000 )       1   0.010%  99.734% 
[   16000,   18000 )       1   0.010%  99.744% 
[   18000,   20000 )       1   0.010%  99.754% 
[   25000,   30000 )       1   0.010%  99.764% 
[   40000,   45000 )       1   0.010%  99.774% 
[   50000,   60000 )       1   0.010%  99.783% 
[   60000,   70000 )       2   0.020%  99.803% 
[   70000,   80000 )       1   0.010%  99.813% 
[   80000,   90000 )       2   0.020%  99.833% 
[   90000,  100000 )       1   0.010%  99.842% 
[  100000,  120000 )       2   0.020%  99.862% 
[  120000,  140000 )       5   0.049%  99.911% 
[  200000,  250000 )       2   0.020%  99.931% 
[  250000,  300000 )       2   0.020%  99.951% 
[  300000,  350000 )       2   0.020%  99.970% 
[  350000,  400000 )       2   0.020%  99.990% 
[  700000,  800000 )       1   0.010% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	157
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0