benchmark/leveldb/results/large-ratio/mris_ratio_ssd.8.1.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:31:07 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    2076.815 micros/op;   10.0 MB/s small: 10000/0; big: 1250/0
Microseconds per op:
Count: 11250  Average: 2076.8313  StdDev: 13202.79
Min: 0.0000  Median: 1028.9199  Max: 562496.0000
------------------------------------------------------
[       0,       1 )      41   0.364%   0.364% 
[       1,       2 )     208   1.849%   2.213% 
[       2,       3 )     662   5.884%   8.098% #
[       3,       4 )     307   2.729%  10.827% #
[       4,       5 )      17   0.151%  10.978% 
[       5,       6 )       3   0.027%  11.004% 
[      14,      16 )       1   0.009%  11.013% 
[      20,      25 )      11   0.098%  11.111% 
[      25,      30 )      76   0.676%  11.787% 
[      30,      35 )     129   1.147%  12.933% 
[      35,      40 )     743   6.604%  19.538% #
[      40,      45 )     685   6.089%  25.627% #
[      45,      50 )      39   0.347%  25.973% 
[      50,      60 )      55   0.489%  26.462% 
[      60,      70 )      11   0.098%  26.560% 
[      70,      80 )       5   0.044%  26.604% 
[      80,      90 )     193   1.716%  28.320% 
[      90,     100 )     550   4.889%  33.209% #
[     100,     120 )     661   5.876%  39.084% #
[     120,     140 )     317   2.818%  41.902% #
[     140,     160 )     200   1.778%  43.680% 
[     160,     180 )     123   1.093%  44.773% 
[     180,     200 )      94   0.836%  45.609% 
[     200,     250 )      68   0.604%  46.213% 
[     250,     300 )      20   0.178%  46.391% 
[     300,     350 )       2   0.018%  46.409% 
[     350,     400 )       2   0.018%  46.427% 
[     400,     450 )      12   0.107%  46.533% 
[     450,     500 )       6   0.053%  46.587% 
[     500,     600 )      16   0.142%  46.729% 
[     600,     700 )      15   0.133%  46.862% 
[     700,     800 )      37   0.329%  47.191% 
[     800,     900 )      69   0.613%  47.804% 
[     900,    1000 )     164   1.458%  49.262% 
[    1000,    1200 )     574   5.102%  54.364% #
[    1200,    1400 )     388   3.449%  57.813% #
[    1400,    1600 )    1058   9.404%  67.218% ##
[    1600,    1800 )     200   1.778%  68.996% 
[    1800,    2000 )      40   0.356%  69.351% 
[    2000,    2500 )      94   0.836%  70.187% 
[    2500,    3000 )    1584  14.080%  84.267% ###
[    3000,    3500 )     408   3.627%  87.893% #
[    3500,    4000 )     243   2.160%  90.053% 
[    4000,    4500 )     270   2.400%  92.453% 
[    4500,    5000 )     130   1.156%  93.609% 
[    5000,    6000 )     317   2.818%  96.427% #
[    6000,    7000 )     208   1.849%  98.276% 
[    7000,    8000 )     126   1.120%  99.396% 
[    8000,    9000 )      11   0.098%  99.493% 
[    9000,   10000 )       6   0.053%  99.547% 
[   10000,   12000 )       5   0.044%  99.591% 
[   12000,   14000 )       3   0.027%  99.618% 
[   14000,   16000 )       2   0.018%  99.636% 
[   16000,   18000 )       4   0.036%  99.671% 
[   20000,   25000 )       1   0.009%  99.680% 
[   35000,   40000 )       4   0.036%  99.716% 
[   50000,   60000 )       1   0.009%  99.724% 
[   60000,   70000 )       2   0.018%  99.742% 
[   70000,   80000 )       1   0.009%  99.751% 
[   80000,   90000 )       2   0.018%  99.769% 
[   90000,  100000 )       3   0.027%  99.796% 
[  100000,  120000 )       4   0.036%  99.831% 
[  120000,  140000 )       4   0.036%  99.867% 
[  140000,  160000 )       2   0.018%  99.884% 
[  160000,  180000 )       1   0.009%  99.893% 
[  180000,  200000 )       1   0.009%  99.902% 
[  200000,  250000 )       1   0.009%  99.911% 
[  250000,  300000 )       3   0.027%  99.938% 
[  300000,  350000 )       1   0.009%  99.947% 
[  350000,  400000 )       3   0.027%  99.973% 
[  500000,  600000 )       3   0.027% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	1250
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0